In [1]:
#Importing Libraries

In [2]:
import pandas as pd
import numpy as np

In [15]:
#In this exercise, we'll merge the details of students from two datasets, namely student.csv and marks.csv. The student dataset contains columns such as Age, Gender, Grade, and Employed. The marks.csv dataset contains columns such as Mark and City. The Student_id column is common between the two datasets. Follow these steps to complete this exercise

In [ ]:
# load the student.csv and marks.csv datasets into the stud_data and mark_data pandas DataFrames.

In [3]:
stud_data = pd.read_csv(r"C:\Users\Mr.MACHINE\Videos\Captures\DATA SCIENCE\PRACTICE\Data PreProcessing\student.csv")

In [4]:
mark_data = pd.read_csv(r"C:\Users\Mr.MACHINE\Videos\Captures\DATA SCIENCE\PRACTICE\Data PreProcessing\mark.csv")

In [16]:
#To print the first five rows of the stud_data DataFrame.

In [5]:
stud_data.head()

   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no

In [17]:
#To print the first five rows of the mark_data DataFrame.

In [6]:
mark_data.head()

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi

In [18]:
# Student_id is common to both datasets. 
# Perform data integration on both the DataFrames with respect to the Student_id column using the pd.merge() function

In [8]:
df = pd.merge(stud_data,mark_data,on="Student_id")

In [ ]:
# and then print the first 10 values of the new DataFrame

In [19]:
df.head(10)

   Student_id  Age  Gender      Grade Employed  Mark     City
0           1   19    Male  1st Class      yes    95  Chennai
1           2   20  Female  2nd Class       no    70    Delhi
2           3   18    Male  1st Class       no    98   Mumbai
3           4   21  Female  2nd Class       no    75     Pune
4           5   19    Male  1st Class       no    89    Kochi
5           6   20    Male  2nd Class      yes    69  Gwalior
6           7   19  Female  3rd Class      yes    52   Bhopal
7           8   21    Male  3rd Class      yes    54  Chennai
8           9   22  Female  3rd Class      yes    55    Delhi
9          10   21    Male  1st Class       no    94   Mumbai

In [20]:
# Here, the data of the stud_data DataFrame is merged with the data of the mark_data DataFrame